Revit 2024 API
MEPNetworkIterator Members
The MEPNetworkIterator type exposes the following members.
Constructors
Name | Description
MEPNetworkIterator(Document, MEPAnalyticalModelData, ConnectorDomainType)
 Creates an iterator by the analytical model data to visit all connected components in the network.
MEPNetworkIterator(Document, MEPAnalyticalNode, MEPAnalyticalSegment)
 Creates an iterator to visit the connected segments on one side of the network.
Methods
Name | Description
Dispose
Releases all resources used by the MEPNetworkIterator
End
 Checks if the network iteration has completed.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModelData
 Gets the analytical model data at the current iteration step.
GetAnalyticalNode
 Gets the analytical node at the current iteration step.
GetAnalyticalSegment
 Gets the analytical segment at the current iteration step.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOtherAnalyticalNode
 Gets the other analytical node at the current iteration step.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Next
 Moves this iterator to the next step of network iteration.
Start
 Gets the first step of network iteration.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CurrentElementId
 The element id at the current iteration step.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SystemClassification
 The optional MEP system classification where the iterations are restricted.
SystemId
 The optional MEP system element id where the iterations are restricted.
See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace